<a href="https://colab.research.google.com/github/pingstech/ZeroToHero-ML/blob/main/04_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Pandas, data frameleri(isim,yaş gibi değişkenler) kullanmak için hızlı ve etkili
#Dosyalar arası geçişleri çok kolaydır (csv ve txt dosyaları açıp inceleyip sonuçlarımızı bu dosya tiplerinde kaydedebiliriz)
#Non-Value yani kayıp(missing data) verilere çözüm üretmek daha kolaydır.
#reshape yapıp datayı daha etkili bir şekilde kullanabiliriz.
#Slicing ve indexing kolay
#Time-series data(zamana bağlı veri) analizine çok yardımcı olur
#En önemlisi HIZLI'dır

In [ ]:
import pandas as pd

tempDictionary={"Name":["Ali","Veli","Kenan","Furkan","Hilal","Evren"],
                "Age":[15,16,17,33,45,66],
                "Sallary":[100,150,155,240,350,229]}
dataFrame1=pd.DataFrame(tempDictionary)
dataFrame1

     Name  Age  Sallary
0     Ali   15      100
1    Veli   16      150
2   Kenan   17      155
3  Furkan   33      240
4   Hilal   45      350
5   Evren   66      229

In [ ]:
#baştaki 5 satırı(default olarak) ver demek için kullanılır
#genellikle ilk başta hemen verilerin ne olduğunu incelemek için kullanılır
head=dataFrame1.head() 
head

     Name  Age  Sallary
0     Ali   15      100
1    Veli   16      150
2   Kenan   17      155
3  Furkan   33      240
4   Hilal   45      350

In [ ]:
#sondaki 5 satırı(default olarak) ver demek için kullanılır
tail=dataFrame1.tail()
tail

     Name  Age  Sallary
1    Veli   16      150
2   Kenan   17      155
3  Furkan   33      240
4   Hilal   45      350
5   Evren   66      229

In [ ]:
#------------PANDAS BASİT KOMUTLAR------------

In [ ]:
print(dataFrame1.columns) #kısacası verinin başlıklarını verir

Index(['Name', 'Age', 'Sallary'], dtype='object')

In [ ]:
print(dataFrame1.info()) #Kullandığımız veri setinin bilgilerini verir

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      int64
 2   Sallary  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes
None

In [ ]:
print(dataFrame1.dtypes)#Her bir sütünün tipini verir

Name       object
Age         int64
Sallary     int64
dtype: object

In [ ]:
print(dataFrame1.describe()) # numeric değerleri tanımlar

             Age     Sallary
count   6.000000    6.000000
mean   32.000000  204.000000
std    20.474374   88.735562
min    15.000000  100.000000
25%    16.250000  151.250000
50%    25.000000  192.000000
75%    42.000000  237.250000
max    66.000000  350.000000

In [ ]:
#------------ Indexing and Slicing------------

In [ ]:
print(dataFrame1)

     Name  Age  Sallary
0     Ali   15      100
1    Veli   16      150
2   Kenan   17      155
3  Furkan   33      240
4   Hilal   45      350
5   Evren   66      229

In [ ]:
print(dataFrame1["Name"]) #Yaparak sadece "NAME"in altında kalan kısmı indekslemiş olduk

0       Ali
1      Veli
2     Kenan
3    Furkan
4     Hilal
5     Evren
Name: Name, dtype: object

In [ ]:
print(dataFrame1["Age"]) #Yaparak sadece "Age"in altında kalan kısmı indekslemiş olduk

0    15
1    16
2    17
3    33
4    45
5    66
Name: Age, dtype: int64

In [ ]:
print(dataFrame1.Age) # Bir önceki yaptığımız işlem ile aynı anlama gelir

0    15
1    16
2    17
3    33
4    45
5    66
Name: Age, dtype: int64

In [ ]:
dataFrame1["Yeni Feature"]=[-1,-2,-3,-4,-5,-6] # Yeni bir frame ekledik fakat Boşluk olmadan yazmamız gerekiyor boşluk bırakırsak aşağıda gördüğümüz gibi iki yeni feature oluşturuyor
dataFrame1 #

     Name  Age  Sallary  Yeni Feature
0     Ali   15      100            -1
1    Veli   16      150            -2
2   Kenan   17      155            -3
3  Furkan   33      240            -4
4   Hilal   45      350            -5
5   Evren   66      229            -6

In [ ]:
print(dataFrame1.loc[:,"Age"])

0    15
1    16
2    17
3    33
4    45
5    66
Name: Age, dtype: int64

In [ ]:
print(dataFrame1.loc[:3,"Age"]) #yani "Age" feature'nın ilk 3 değerini al

0    15
1    16
2    17
3    33
Name: Age, dtype: int64

In [ ]:
print(dataFrame1.loc[:3,"Name":"Age"])

     Name  Age
0     Ali   15
1    Veli   16
2   Kenan   17
3  Furkan   33

In [ ]:
print(dataFrame1.loc[:3,["Name","Age"]])

     Name  Age
0     Ali   15
1    Veli   16
2   Kenan   17
3  Furkan   33

In [ ]:
print(dataFrame1.loc[::-1,:]) # Tüm satırları tersten yazdırma

     Name  Age  Sallary  Yeni Feature
5   Evren   66      229            -6
4   Hilal   45      350            -5
3  Furkan   33      240            -4
2   Kenan   17      155            -3
1    Veli   16      150            -2
0     Ali   15      100            -1

In [ ]:
print(dataFrame1.loc[:,:"Sallary"]) #Tüm satırları yazdır ama "sallary"e kadar olanları yazdır

     Name  Age  Sallary
0     Ali   15      100
1    Veli   16      150
2   Kenan   17      155
3  Furkan   33      240
4   Hilal   45      350
5   Evren   66      229

In [ ]:
print(dataFrame1.loc[:,"Name"]) # yazmak yerine
print(dataFrame1.iloc[:,0]) # yerine yazabiliriz

0       Ali
1      Veli
2     Kenan
3    Furkan
4     Hilal
5     Evren
Name: Name, dtype: object
0       Ali
1      Veli
2     Kenan
3    Furkan
4     Hilal
5     Evren
Name: Name, dtype: object

In [ ]:
#------------ Filtering ------------

In [ ]:
import pandas as pd

tempDictionary={"Name":["Ali","Veli","Kenan","Furkan","Hilal","Evren"],
                "Age":[15,16,17,33,45,66],
                "Sallary":[100,150,155,240,350,229]}
dataFrame1=pd.DataFrame(tempDictionary)
dataFrame1
tempFilter1=dataFrame1.Sallary > 200
tempFilter1

0    False
1    False
2    False
3     True
4     True
5     True
Name: Sallary, dtype: bool

In [ ]:
filteredData=dataFrame1[tempFilter1] #MAAŞI 200'ÜN ÜSTÜNDEKİLERİ BULMUŞ OLDUK
filteredData

     Name  Age  Sallary  Yeni Feature
3  Furkan   33      240            -4
4   Hilal   45      350            -5
5   Evren   66      229            -6

In [ ]:
tempFilter2=dataFrame1.Age < 35 #yaşı 35'in altında olanlar
tempFilter2

0     True
1     True
2     True
3     True
4    False
5    False
Name: Age, dtype: bool

In [ ]:
dataFrame1[tempFilter1 & tempFilter2] # yaşı 35'in altı ve maaşı 200 ₺'den yüksek olanları filtreledik

     Name  Age  Sallary  Yeni Feature
3  Furkan   33      240            -4

In [ ]:
print(dataFrame1[dataFrame1.Age > 60])

    Name  Age  Sallary  Yeni Feature
5  Evren   66      229            -6

In [ ]:
#------------LIST COMPREHENSION------------

In [ ]:
aveSallary=dataFrame1.Sallary.mean() #Ortalama maaşı bulduk
aveSallary

204.0

In [ ]:
import numpy as np

aveSallary_np=np.mean(dataFrame1.Sallary)
aveSallary

204.0

In [ ]:
dataFrame1["SallaryLevel"]=["Low Sallary" if aveSallary > each else "High Sallary" for each in dataFrame1.Sallary] 
              #Yukarıdaki gibi yaparsak tek satırda yapmış oluyoruz işlemleri
dataFrame1

     Name  Age  Sallary  Yeni Feature  SallaryLevel
0     Ali   15      100            -1   Low Sallary
1    Veli   16      150            -2   Low Sallary
2   Kenan   17      155            -3   Low Sallary
3  Furkan   33      240            -4  High Sallary
4   Hilal   45      350            -5  High Sallary
5   Evren   66      229            -6  High Sallary

In [ ]:
for each in dataFrame1.Sallary: #Yukarıda yazdığımız kodun uzun hali
  if(aveSallary>each):
    print("High Sallary")
  else:
    print("Low Sallary")
dataFrame1

High Sallary
High Sallary
High Sallary
Low Sallary
Low Sallary
Low Sallary

     Name  Age  Sallary  Yeni Feature  SallaryLevel
0     Ali   15      100            -1   Low Sallary
1    Veli   16      150            -2   Low Sallary
2   Kenan   17      155            -3   Low Sallary
3  Furkan   33      240            -4  High Sallary
4   Hilal   45      350            -5  High Sallary
5   Evren   66      229            -6  High Sallary

In [ ]:
dataFrame1.columns=[ each.lower() for each in dataFrame1.columns] #tüm sütunları küçük harfe çevirip tekrardan yazdırıyoruz
dataFrame1

     name  age  sallary  yeni feature  sallarylevel
0     Ali   15      100            -1   Low Sallary
1    Veli   16      150            -2   Low Sallary
2   Kenan   17      155            -3   Low Sallary
3  Furkan   33      240            -4  High Sallary
4   Hilal   45      350            -5  High Sallary
5   Evren   66      229            -6  High Sallary

In [ ]:
dataFrame1.columns=[each.split()[0]+"_"+each.split()[1] if(len(each.split())>1) else each for each in dataFrame1.columns]
#                       BURADA EĞER BAŞLIKLAR ARASINDA BOŞLUK KARAKTERİ VARSA ONUN SİLİNİP "_" İLE BİRLEŞTİRDİK.
dataFrame1

     name  age  sallary  yeni_feature  sallarylevel
0     Ali   15      100            -1   Low Sallary
1    Veli   16      150            -2   Low Sallary
2   Kenan   17      155            -3   Low Sallary
3  Furkan   33      240            -4  High Sallary
4   Hilal   45      350            -5  High Sallary
5   Evren   66      229            -6  High Sallary

In [ ]:
#------------DROP AND CONCATENATING------------

In [ ]:
dataFrame1

     name  age  sallary  yeni_feature  sallarylevel
0     Ali   15      100            -1   Low Sallary
1    Veli   16      150            -2   Low Sallary
2   Kenan   17      155            -3   Low Sallary
3  Furkan   33      240            -4  High Sallary
4   Hilal   45      350            -5  High Sallary
5   Evren   66      229            -6  High Sallary

In [ ]:
dataFrame1.drop(["yeni_feature"],axis=1) # axis=1 demek yukarıdan aşağıya yani sütünü, axis=0 olsaydı soldan sağa yani satırı kapsayacaktı, drop ile yaparsak o anlık göstermez

     name  age  sallary  sallarylevel
0     Ali   15      100   Low Sallary
1    Veli   16      150   Low Sallary
2   Kenan   17      155   Low Sallary
3  Furkan   33      240  High Sallary
4   Hilal   45      350  High Sallary
5   Evren   66      229  High Sallary

In [ ]:
# Fakat drop işlemi yaparkan "inplace=True" kısmını eklersek kalıcı olarak silecek
print("Eski DataFrame1")
print(dataFrame1)
dataFrame1.drop(["yeni_feature"],axis=1,inplace=True)
print("Eski DataFrame1")
print(dataFrame1)

Eski DataFrame1
     name  age  sallary  yeni_feature  sallarylevel
0     Ali   15      100            -1   Low Sallary
1    Veli   16      150            -2   Low Sallary
2   Kenan   17      155            -3   Low Sallary
3  Furkan   33      240            -4  High Sallary
4   Hilal   45      350            -5  High Sallary
5   Evren   66      229            -6  High Sallary
Eski DataFrame1
     name  age  sallary  sallarylevel
0     Ali   15      100   Low Sallary
1    Veli   16      150   Low Sallary
2   Kenan   17      155   Low Sallary
3  Furkan   33      240  High Sallary
4   Hilal   45      350  High Sallary
5   Evren   66      229  High Sallary

In [ ]:
data1=dataFrame1.head()
data2=dataFrame1.tail()
#Dikey olarak birleştirelim
dataConcat=pd.concat([data1,data2],axis=0)
dataConcat

     name  age  sallary  sallarylevel
0     Ali   15      100   Low Sallary
1    Veli   16      150   Low Sallary
2   Kenan   17      155   Low Sallary
3  Furkan   33      240  High Sallary
4   Hilal   45      350  High Sallary
1    Veli   16      150   Low Sallary
2   Kenan   17      155   Low Sallary
3  Furkan   33      240  High Sallary
4   Hilal   45      350  High Sallary
5   Evren   66      229  High Sallary

In [ ]:
sallary=dataFrame1.sallary
age=dataFrame1.age
#Yatay olarak birleştirelim
dataHConcat=pd.concat([age,sallary],axis=1)

In [ ]:
dataHConcat

   age  sallary
0   15      100
1   16      150
2   17      155
3   33      240
4   45      350
5   66      229

In [ ]:
#------------TRANSFORMING DATA------------

In [ ]:
dataFrame1["list_comp"]=[ each*2 for each in dataFrame1.age]
dataFrame1

     name  age  sallary  sallarylevel  list_comp
0     Ali   15      100   Low Sallary         30
1    Veli   16      150   Low Sallary         32
2   Kenan   17      155   Low Sallary         34
3  Furkan   33      240  High Sallary         66
4   Hilal   45      350  High Sallary         90
5   Evren   66      229  High Sallary        132

In [ ]:
def multiply(age):
  return age*2

dataFrame1["apply_metodu"] = dataFrame1.age.apply(multiply)

In [ ]:
dataFrame1

     name  age  sallary  sallarylevel  list_comp  apply_metodu
0     Ali   15      100   Low Sallary         30            30
1    Veli   16      150   Low Sallary         32            32
2   Kenan   17      155   Low Sallary         34            34
3  Furkan   33      240  High Sallary         66            66
4   Hilal   45      350  High Sallary         90            90
5   Evren   66      229  High Sallary        132           132